Repository: phai-nguyen/EKA2L1-S60-OMAP2420-iOS
Catalog: patches/Localizable.xcstrings
Source language: en
Languages: vi, zh_hans

# common.cancel
source: Cancel
vi: Hủy
zh_hans: 取消

# common.completed
source: Completed!
vi: Hoàn tất!
zh_hans: 完成！

# common.done
source: Done
vi: Xong
zh_hans: 完成

# common.error
source: Error
vi: Lỗi
zh_hans: 错误

# common.install
source: Install
vi: Cài đặt
zh_hans: 安装

# controllerMapping.actions
source: Function keys
vi: Phím chức năng
zh_hans: 功能键

# controllerMapping.clearBinding
source: Clear Binding
vi: Xóa gán phím
zh_hans: 清除绑定

# controllerMapping.currentBinding %@
source: Currently bound: %@
vi: Đang gán: %@
zh_hans: 当前绑定：%@

# controllerMapping.deviceDisconnected
source: Device disconnected.
vi: Thiết bị đã ngắt kết nối.
zh_hans: 设备已断开连接。

# controllerMapping.directions
source: Directions
vi: Điều hướng
zh_hans: 方向键

# controllerMapping.directions.hint
source: The d-pad and both thumbsticks can be mapped independently.
vi: D-pad và hai cần analog có thể được gán độc lập.
zh_hans: 十字键与左右摇杆可以分别映射。

# controllerMapping.leftStickDown
source: Left Stick Down
vi: Cần trái xuống
zh_hans: 左摇杆下

# controllerMapping.leftStickLeft
source: Left Stick Left
vi: Cần trái sang trái
zh_hans: 左摇杆左

# controllerMapping.leftStickRight
source: Left Stick Right
vi: Cần trái sang phải
zh_hans: 左摇杆右

# controllerMapping.leftStickUp
source: Left Stick Up
vi: Cần trái lên
zh_hans: 左摇杆上

# controllerMapping.noController
source: No game controller or keyboard connected.
vi: Chưa kết nối tay cầm hoặc bàn phím.
zh_hans: 未连接游戏手柄或键盘。

# controllerMapping.numbers
source: Number keys
vi: Phím số
zh_hans: 数字键

# controllerMapping.pressButton
source: Press a button on the controller…
vi: Nhấn một nút trên tay cầm…
zh_hans: 请按手柄上的一个按键…

# controllerMapping.pressKey
source: Press a key on the keyboard…
vi: Nhấn một phím trên bàn phím…
zh_hans: 请按键盘上的一个按键…

# controllerMapping.reset
source: Reset to Defaults
vi: Khôi phục mặc định
zh_hans: 恢复默认设置

# controllerMapping.rightStickDown
source: Right Stick Down
vi: Cần phải xuống
zh_hans: 右摇杆下

# controllerMapping.rightStickLeft
source: Right Stick Left
vi: Cần phải sang trái
zh_hans: 右摇杆左

# controllerMapping.rightStickRight
source: Right Stick Right
vi: Cần phải sang phải
zh_hans: 右摇杆右

# controllerMapping.rightStickUp
source: Right Stick Up
vi: Cần phải lên
zh_hans: 右摇杆上

# controllerPointer.down
source: Pointer down
vi: Con trỏ xuống
zh_hans: 指针下移

# controllerPointer.enabled
source: Controller pointer
vi: Con trỏ tay cầm
zh_hans: 手柄指针

# controllerPointer.hint
source: Pointer controls require an external display and Full Screen. Hold Touch while moving to drag. Hidden pointers restore game key bindings. Motion and vibration use the controller when supported.
vi: Điều khiển con trỏ cần màn hình ngoài và chế độ Toàn màn hình. Giữ Chạm trong khi di chuyển để kéo. Khi ẩn con trỏ, các phím game sẽ được khôi phục. Chuyển động và rung sử dụng tay cầm khi được hỗ trợ.
zh_hans: 指针控制需要外接显示器并开启全屏。移动时按住“触摸”即可拖动。隐藏指针后会恢复游戏按键映射。体感与震动在手柄支持时使用手柄。

# controllerPointer.left
source: Pointer left
vi: Con trỏ sang trái
zh_hans: 指针左移

# controllerPointer.motion
source: Controller motion
vi: Chuyển động tay cầm
zh_hans: 手柄体感

# controllerPointer.right
source: Pointer right
vi: Con trỏ sang phải
zh_hans: 指针右移

# controllerPointer.section
source: AirPlay & Full Screen
vi: AirPlay & Toàn màn hình
zh_hans: AirPlay 与全屏

# controllerPointer.toggle
source: Show / hide pointer
vi: Hiện / ẩn con trỏ
zh_hans: 显示/隐藏指针

# controllerPointer.touch
source: Touch / drag
vi: Chạm / kéo
zh_hans: 触摸/拖动

# controllerPointer.up
source: Pointer up
vi: Con trỏ lên
zh_hans: 指针上移

# controllerPointer.vibration
source: Controller vibration
vi: Rung tay cầm
zh_hans: 手柄震动

# device.rescan
source: Rescan devices
vi: Quét lại thiết bị
zh_hans: 重新扫描设备

# devices.delete
source: Delete
vi: Xóa
zh_hans: 删除

# devices.hint
source: Tap a device to switch to it. Swipe left to rename it or remove it along with its data.
vi: Chạm vào thiết bị để chuyển sang thiết bị đó. Vuốt sang trái để đổi tên hoặc xóa thiết bị cùng dữ liệu của nó.
zh_hans: 点按设备即可切换。向左轻扫可重命名，或连同其数据一并删除。

# devices.installed
source: Installed Devices
vi: Thiết bị đã cài
zh_hans: 已安装的设备

# devices.name
source: Device name
vi: Tên thiết bị
zh_hans: 设备名称

# devices.none
source: No devices installed.
vi: Chưa cài thiết bị nào.
zh_hans: 尚未安装任何设备。

# devices.rename
source: Rename
vi: Đổi tên
zh_hans: 重命名

# devices.renameFailed
source: Could not rename the device. Please try again.
vi: Không thể đổi tên thiết bị. Vui lòng thử lại.
zh_hans: 无法重命名该设备，请重试。

# devices.rescanHint
source: Rescanning rebuilds the list from the device files already on disk — use it if an installed device went missing.
vi: Quét lại sẽ dựng lại danh sách từ các tệp thiết bị đã có trên bộ nhớ — dùng khi một thiết bị đã cài bị mất khỏi danh sách.
zh_hans: 重新扫描会根据磁盘上已有的设备文件重建列表——如果已安装的设备不见了，可以用它找回。

# devices.title
source: Manage Devices
vi: Quản lý thiết bị
zh_hans: 管理设备

# devices.working
source: Working…
vi: Đang xử lý…
zh_hans: 处理中…

# display.editor.editLayout
source: Edit Display Layout
vi: Chỉnh bố cục màn hình
zh_hans: 编辑画面布局

# display.editor.hint
source: Drag the picture to move it
vi: Kéo hình ảnh để di chuyển
zh_hans: 拖动以移动画面

# display.editor.reset
source: Reset display layout
vi: Đặt lại bố cục màn hình
zh_hans: 重置画面布局

# display.editor.scale
source: Picture size
vi: Kích thước hình ảnh
zh_hans: 画面大小

# display.gravity.bottom
source: Align bottom
vi: Căn dưới
zh_hans: 靠下

# display.gravity.center
source: Centre
vi: Căn giữa
zh_hans: 居中

# display.gravity.left
source: Align left
vi: Căn trái
zh_hans: 靠左

# display.gravity.right
source: Align right
vi: Căn phải
zh_hans: 靠右

# display.gravity.top
source: Align top
vi: Căn trên
zh_hans: 靠上

# emulator.enterText
source: Enter Text
vi: Nhập văn bản
zh_hans: 输入文字

# emulator.exit
source: Exit Game
vi: Thoát game
zh_hans: 退出游戏

# emulator.fps.accessibility
source: Game FPS
vi: FPS game
zh_hans: 游戏帧率

# emulator.fpsLimit.unlimited
source: Unlimited
vi: Không giới hạn
zh_hans: 不限制

# emulator.guestFatal
source: Guest error
vi: Lỗi hệ thống khách
zh_hans: 客户机错误

# emulator.menu
source: Game menu
vi: Menu game
zh_hans: 游戏菜单

# emulator.menu.fpsLimit
source: Frame Rate Limit
vi: Giới hạn tốc độ khung hình
zh_hans: 帧率限制

# emulator.menu.fullScreen
source: Full Screen
vi: Toàn màn hình
zh_hans: 全屏

# emulator.menu.gameSettings
source: Game Settings
vi: Cài đặt game
zh_hans: 游戏设置

# emulator.menu.guestScreenMode
source: Guest Screen Mode
vi: Chế độ màn hình máy khách
zh_hans: 客户机屏幕模式

# emulator.menu.lockOrientation
source: Orientation Lock
vi: Khóa xoay màn hình
zh_hans: 方向锁定

# emulator.saveScreenshot
source: Save Screenshot
vi: Lưu ảnh chụp màn hình
zh_hans: 存储截屏

# emulator.screenshot.failed
source: Could not capture the screen.
vi: Không thể chụp màn hình.
zh_hans: 无法截取屏幕。

# emulator.screenshot.saved
source: Screenshot saved to Photos.
vi: Đã lưu ảnh chụp màn hình vào Ảnh.
zh_hans: 截屏已存储到“照片”。

# home.appsCount %lld
source: Apps (%lld)
vi: Ứng dụng (%lld)
zh_hans: 应用（%lld）

# home.banner.booted %@ %@
source: Booted %1$@ (%2$@).
vi: Đã khởi động %1$@ (%2$@).
zh_hans: 已启动 %1$@（%2$@）。

# home.banner.copied %@
source: Copied %@.
vi: Đã sao chép %@.
zh_hans: 已复制 %@。

# home.banner.importFailed %@
source: Import failed: %@
vi: Nhập thất bại: %@
zh_hans: 导入失败：%@

# home.banner.installDeviceFirst
source: Install a device (ROM) first, then re-open the SIS file.
vi: Hãy cài thiết bị (ROM) trước, sau đó mở lại tệp SIS.
zh_hans: 请先安装一个设备（ROM），然后重新打开该 SIS 文件。

# home.banner.installedPackages %lld
source: Installed %lld packages.
vi: Đã cài %lld gói.
zh_hans: 已安装 %lld 个软件包。

# home.banner.installingPackages %lld
source: Installing %lld packages...
vi: Đang cài %lld gói...
zh_hans: 正在安装 %lld 个软件包…

# home.banner.uninstallFailed %@
source: Failed to uninstall %@.
vi: Không thể gỡ cài đặt %@.
zh_hans: 卸载 %@ 失败。

# home.banner.uninstalled %@
source: Uninstalled %@.
vi: Đã gỡ cài đặt %@.
zh_hans: 已卸载 %@。

# home.card.eject
source: Eject Card
vi: Tháo thẻ
zh_hans: 弹出存储卡

# home.card.ejected
source: Card ejected
vi: Đã tháo thẻ
zh_hans: 存储卡已弹出

# home.card.error.corrupt
source: The card archive could not be extracted.
vi: Không thể giải nén tệp thẻ.
zh_hans: 无法解压存储卡压缩包。

# home.card.error.generic
source: The card could not be mounted.
vi: Không thể gắn thẻ.
zh_hans: 无法挂载存储卡。

# home.card.error.noSystemFolder
source: The card dump has no System folder at its root.
vi: Bản dump thẻ không có thư mục System ở thư mục gốc.
zh_hans: 存储卡转储的根目录下没有 System 文件夹。

# home.card.error.notArchive
source: Unsupported card archive format.
vi: Định dạng tệp thẻ không được hỗ trợ.
zh_hans: 不支持的存储卡压缩包格式。

# home.card.error.notFound
source: The card dump could not be found.
vi: Không tìm thấy bản dump thẻ.
zh_hans: 找不到存储卡转储。

# home.card.mounted
source: Card mounted on drive E
vi: Đã gắn thẻ vào ổ E
zh_hans: 存储卡已挂载为 E 盘

# home.card.mountedWithId %@
source: Card mounted on drive E, MMC ID %@
vi: Đã gắn thẻ vào ổ E, MMC ID %@
zh_hans: 存储卡已挂载为 E 盘，MMC ID 为 %@

# home.card.mounting
source: Mounting card…
vi: Đang gắn thẻ…
zh_hans: 正在挂载存储卡…

# home.empty.hiddenSystemApps
source: No installed apps. Tap + to install a SIS / SISX package, or enable Show System Apps.
vi: Không có ứng dụng đã cài. Chạm + để cài gói SIS / SISX hoặc bật Hiện ứng dụng hệ thống.
zh_hans: 尚未安装应用。点按 + 安装 SIS / SISX 软件包，或开启“显示系统应用”。

# home.empty.noApps
source: No apps yet. Tap + to install a SIS / SISX package.
vi: Chưa có ứng dụng. Chạm + để cài gói SIS / SISX.
zh_hans: 还没有应用。点按 + 安装 SIS / SISX 软件包。

# home.error.bootRomFailed %@
source: Failed to boot ROM code %@.
vi: Không thể khởi động mã ROM %@.
zh_hans: 启动 ROM 代号 %@ 失败。

# home.error.checkConsole
source: Check Console for details.
vi: Kiểm tra Console để biết chi tiết.
zh_hans: 详情请查看“控制台”。

# home.error.deviceBootCrashed %@
source: %@ took the app down while it was starting up, so it was skipped this time. Its ROM (or RPKG) dump is likely damaged — delete the device and install it again from a good dump.
vi: %@ làm ứng dụng bị thoát khi đang khởi động nên lần này thiết bị đã bị bỏ qua. Bản dump ROM (hoặc RPKG) có thể bị hỏng — hãy xóa thiết bị rồi cài lại từ một bản dump tốt.
zh_hans: %@ 在启动过程中导致应用崩溃，因此本次已跳过。它的 ROM（或 RPKG）转储很可能已损坏——请删除该设备，再用完好的转储重新安装。

# home.error.deviceBootCrashedTitle
source: Device could not be started
vi: Không thể khởi động thiết bị
zh_hans: 无法启动设备

# home.error.initTitle
source: Emulator failed to initialise
vi: Không thể khởi tạo trình giả lập
zh_hans: 模拟器初始化失败

# home.error.launchRomMissing %@
source: Launch ROM code %@ is missing.
vi: Thiếu mã ROM khởi chạy %@.
zh_hans: 找不到启动用的 ROM 代号 %@。

# home.fonts.imported %lld
source: Installed %lld fonts. Restart the device to use them.
vi: Đã cài %lld phông chữ. Hãy khởi động lại thiết bị để sử dụng.
zh_hans: 已安装 %lld 个字体，重新启动设备后即可使用。

# home.fonts.importing %lld
source: Installing %lld fonts…
vi: Đang cài %lld phông chữ…
zh_hans: 正在安装 %lld 个字体…

# home.fonts.unsupported
source: No supported font selected. Pick a .ttf file.
vi: Chưa chọn phông chữ được hỗ trợ. Hãy chọn tệp .ttf.
zh_hans: 未选择受支持的字体，请选择 .ttf 文件。

# home.hideSystemApps
source: Hide System Apps
vi: Ẩn ứng dụng hệ thống
zh_hans: 隐藏系统应用

# home.install
source: Install
vi: Cài đặt
zh_hans: 安装

# home.install.sis
source: Install SIS/SISX Package
vi: Cài gói SIS/SISX
zh_hans: 安装 SIS/SISX 软件包

# home.installFonts
source: Install Fonts
vi: Cài phông chữ
zh_hans: 安装字体

# home.installFonts.subtitle
source: TrueType (TTF) files
vi: Tệp TrueType (TTF)
zh_hans: TrueType（TTF）文件

# home.installNGage
source: Install N-Gage Game
vi: Cài game N-Gage
zh_hans: 安装 N-Gage 游戏

# home.installNGage.subtitle
source: Copied onto drive E
vi: Sao chép vào ổ E
zh_hans: 复制到 E 盘

# home.installNGage2
source: Import N-Gage 2.0 Game
vi: Nhập game N-Gage 2.0
zh_hans: 导入 N-Gage 2.0 游戏

# home.installNGage2.subtitle
source: Requires S60v3 ROM and N-Gage launcher
vi: Cần ROM S60v3 và trình khởi chạy N-Gage
zh_hans: 需要 S60v3 ROM 与 N-Gage 启动器

# home.more
source: More
vi: Thêm
zh_hans: 更多

# home.mountCard
source: Mount MMC/SD Card
vi: Gắn thẻ MMC/SD
zh_hans: 挂载 MMC/SD 卡

# home.mountCard.subtitle
source: Becomes drive E until ejected
vi: Trở thành ổ E cho đến khi tháo
zh_hans: 弹出前作为 E 盘使用

# home.ngage.error.chooseFolder
source: N-Gage import failed: choose the game card folder or archive that contains the system folder.
vi: Nhập N-Gage thất bại: hãy chọn thư mục thẻ game hoặc tệp nén có chứa thư mục system.
zh_hans: N-Gage 导入失败：请选择包含 system 文件夹的游戏卡文件夹或压缩包。

# home.ngage.error.generic %lld
source: N-Gage import failed (error %lld).
vi: Nhập N-Gage thất bại (lỗi %lld).
zh_hans: N-Gage 导入失败（错误 %lld）。

# home.ngage.error.multipleGames
source: N-Gage import failed: that game card contains more than one game.
vi: Nhập N-Gage thất bại: thẻ game đó chứa nhiều hơn một game.
zh_hans: N-Gage 导入失败：该游戏卡包含多个游戏。

# home.ngage.error.regCorrupt
source: N-Gage import failed: the registration file is corrupted.
vi: Nhập N-Gage thất bại: tệp đăng ký bị hỏng.
zh_hans: N-Gage 导入失败：注册文件已损坏。

# home.ngage.error.regMissing
source: N-Gage import failed: the registration file is missing.
vi: Nhập N-Gage thất bại: thiếu tệp đăng ký.
zh_hans: N-Gage 导入失败：缺少注册文件。

# home.ngage.importFailed %@
source: N-Gage import failed: %@
vi: Nhập N-Gage thất bại: %@
zh_hans: N-Gage 导入失败：%@

# home.ngage.installed
source: Installed N-Gage game.
vi: Đã cài game N-Gage.
zh_hans: 已安装 N-Gage 游戏。

# home.ngage.installedNamed %@
source: Installed N-Gage game: %@.
vi: Đã cài game N-Gage: %@.
zh_hans: 已安装 N-Gage 游戏：%@。

# home.ngage.installing
source: Installing N-Gage game...
vi: Đang cài game N-Gage...
zh_hans: 正在安装 N-Gage 游戏…

# home.ngage2.imported %lld
source: Imported %lld packages. Open the N-Gage launcher to continue.
vi: Đã nhập %lld gói. Mở trình khởi chạy N-Gage để tiếp tục.
zh_hans: 已导入 %lld 个软件包。打开 N-Gage 启动器以继续。

# home.ngage2.importing %lld
source: Importing %lld N-Gage 2.0 packages...
vi: Đang nhập %lld gói N-Gage 2.0...
zh_hans: 正在导入 %lld 个 N-Gage 2.0 软件包…

# home.noDevice.title
source: No device installed
vi: Chưa cài thiết bị
zh_hans: 尚未安装设备

# home.showSystemApps
source: Show System Apps
vi: Hiện ứng dụng hệ thống
zh_hans: 显示系统应用

# home.uninstall.action
source: Uninstall
vi: Gỡ cài đặt
zh_hans: 卸载

# home.uninstall.confirm
source: Uninstall
vi: Gỡ cài đặt
zh_hans: 卸载

# home.uninstall.message
source: This removes the package and its files from the device.
vi: Thao tác này sẽ xóa gói và các tệp của gói khỏi thiết bị.
zh_hans: 这会从设备上删除该软件包及其文件。

# home.uninstall.title %@
source: Uninstall %@?
vi: Gỡ cài đặt %@?
zh_hans: 要卸载 %@ 吗？

# import.archiveFile
source: 7z archive
vi: Tệp nén 7z
zh_hans: 7z 压缩包

# import.archiveHint
source: Choose a .7z holding a device. Both common packagings work: a ROM image with its RPKG, or a device someone already unpacked into the emulator's folder layout (data/roms and data/drives/z). Anything else in the archive is ignored, so a pack meant to be dropped into the EKA2L1 folder by hand installs as-is.
vi: Chọn tệp .7z chứa một thiết bị. Hỗ trợ cả hai kiểu đóng gói phổ biến: ảnh ROM kèm RPKG, hoặc thiết bị đã được giải nén sẵn theo cấu trúc thư mục của trình giả lập (data/roms và data/drives/z). Mọi nội dung khác trong tệp nén sẽ bị bỏ qua, vì vậy gói vốn được thiết kế để chép thủ công vào thư mục EKA2L1 vẫn có thể cài nguyên trạng.
zh_hans: 选择一个包含设备的 .7z 文件。两种常见打包方式都支持：ROM 镜像连同它的 RPKG，或别人已经按模拟器目录结构解包好的设备（data/roms 与 data/drives/z）。 压缩包里的其他内容会被忽略，因此原本打算手动放进 EKA2L1 文件夹的包可以直接安装。

# import.cancelled
source: Install cancelled.
vi: Đã hủy cài đặt.
zh_hans: 安装已取消。

# import.cancelling
source: Cancelling…
vi: Đang hủy…
zh_hans: 正在取消…

# import.error.alreadyExists
source: Device to install already exists!
vi: Thiết bị cần cài đã tồn tại!
zh_hans: 要安装的设备已存在！

# import.error.archiveCorrupt
source: The archive could not be read. It may be incomplete, or use a compression method this build does not support.
vi: Không thể đọc tệp nén. Tệp có thể chưa đầy đủ hoặc dùng phương thức nén mà bản dựng này không hỗ trợ.
zh_hans: 无法读取该压缩包。它可能不完整，或使用了此版本不支持的压缩方式。

# import.error.archiveNoDevice
source: The archive holds no device: it needs either a ROM image (with its RPKG, if the ROM needs one) or an unpacked drive Z tree.
vi: Tệp nén không chứa thiết bị: cần có ảnh ROM (kèm RPKG nếu ROM yêu cầu) hoặc cây thư mục ổ Z đã giải nén.
zh_hans: 压缩包里没有设备：它需要包含 ROM 镜像（如果该 ROM 需要，还要有对应的 RPKG），或者已解包的 Z 盘目录树。

# import.error.determineProduct
source: Failed to determine product information!
vi: Không thể xác định thông tin sản phẩm!
zh_hans: 无法确定产品信息！

# import.error.fpsxCorrupt
source: FPSX file is corrupted!
vi: Tệp FPSX bị hỏng!
zh_hans: FPSX 文件已损坏！

# import.error.insufficient
source: RPKG file is too small; the dump might be unfinished!
vi: Tệp RPKG quá nhỏ; bản dump có thể chưa hoàn tất!
zh_hans: RPKG 文件过小，转储可能尚未完成！

# import.error.needRpkg
source: This ROM requires an additional RPKG file. Please choose one and try again.
vi: ROM này cần thêm tệp RPKG. Hãy chọn tệp rồi thử lại.
zh_hans: 该 ROM 需要额外的 RPKG 文件，请选择一个后重试。

# import.error.notExist
source: RPKG file specified cannot be opened!
vi: Không thể mở tệp RPKG đã chỉ định!
zh_hans: 无法打开指定的 RPKG 文件！

# import.error.rofsCorrupt
source: ROFS file is corrupted!
vi: Tệp ROFS bị hỏng!
zh_hans: ROFS 文件已损坏！

# import.error.romCopy
source: Failed to copy ROM to target destination!
vi: Không thể sao chép ROM đến vị trí đích!
zh_hans: 无法将 ROM 复制到目标位置！

# import.error.romCorrupt
source: ROM file is corrupted!
vi: Tệp ROM bị hỏng!
zh_hans: ROM 文件已损坏！

# import.error.rpkgCorrupt
source: The RPKG file provided is corrupt!
vi: Tệp RPKG đã cung cấp bị hỏng!
zh_hans: 提供的 RPKG 文件已损坏！

# import.error.vplInvalid
source: The firmware description file (VPL) is invalid!
vi: Tệp mô tả firmware (VPL) không hợp lệ!
zh_hans: 固件描述文件（VPL）无效！

# import.error.wrongExtension %@
source: Please choose a %@ file.
vi: Hãy chọn tệp %@.
zh_hans: 请选择 %@ 文件。

# import.installing %lld
source: Unpacking the dump… %lld%%
vi: Đang giải nén bản dump… %lld%%
zh_hans: 正在解包转储… %lld%%

# import.noDeviceInstalled
source: Please install a device. Files and ROM of a Symbian device are needed for the installation. Note: Each app needs a suitable Symbian device to run.
vi: Vui lòng cài một thiết bị. Cần các tệp và ROM của thiết bị Symbian để cài đặt. Lưu ý: Mỗi ứng dụng cần một thiết bị Symbian phù hợp để chạy.
zh_hans: 请先安装设备。安装过程需要 Symbian 设备的文件和 ROM。 注意：每个应用都需要合适的 Symbian 设备才能运行。

# import.noFileSelected
source: Tap to choose...
vi: Chạm để chọn...
zh_hans: 点按以选择…

# import.recommendedDevices
source: Recommended devices to install: S60v1: N-Gage S60v2: Nokia N70 S60v3: Nokia 5320 XpressMusic, Nokia E5 S60v5: Nokia 5800 XpressMusic, Nokia 5230 For S60v2 devices or higher, you may need to provide an additional file called RPKG. For more info about device install, please check out our wiki: [eka2l1.miraheze.org](https://eka2l1.miraheze.org/wiki/Main_Page)
vi: Thiết bị khuyến nghị: S60v1: N-Gage S60v2: Nokia N70 S60v3: Nokia 5320 XpressMusic, Nokia E5 S60v5: Nokia 5800 XpressMusic, Nokia 5230 Với thiết bị S60v2 trở lên, bạn có thể cần cung cấp thêm tệp RPKG. Để biết thêm về cách cài thiết bị, hãy xem wiki: [eka2l1.miraheze.org](https://eka2l1.miraheze.org/wiki/Main_Page)
zh_hans: 推荐安装的设备： S60v1：N-Gage S60v2：Nokia N70 S60v3：Nokia 5320 XpressMusic、Nokia E5 S60v5：Nokia 5800 XpressMusic、Nokia 5230 S60v2 及更高版本的设备可能还需要提供一个名为 RPKG 的额外文件。 关于设备安装的更多信息，请查看我们的 wiki：[eka2l1.miraheze.org](https://eka2l1.miraheze.org/wiki/Main_Page)

# import.romFile
source: ROM file
vi: Tệp ROM
zh_hans: ROM 文件

# import.rpkgFile
source: RPKG file (optional)
vi: Tệp RPKG (tùy chọn)
zh_hans: RPKG 文件（可选）

# import.source
source: Install from
vi: Cài đặt từ
zh_hans: 安装来源

# import.source.archive
source: 7z archive
vi: Tệp nén 7z
zh_hans: 7z 压缩包

# import.firmwareFolder
source: Firmware folder
vi: Thư mục firmware
zh_hans: 固件文件夹

# import.firmwareVPL
source: VPL file
vi: File VPL
zh_hans: VPL 文件

# import.firmwareHint
source: Choose the folder containing VPL and FPSX files, or select all those files together. The first VPL variant will be installed.
vi: Chọn thư mục chứa VPL và FPSX, hoặc chọn tất cả các file đó cùng lúc. Ứng dụng sẽ cài biến thể đầu tiên trong VPL.
zh_hans: 选择包含 VPL 和 FPSX 文件的文件夹，或同时选择所有这些文件。将安装 VPL 中的第一个版本。

# import.error.noVPL
source: No VPL file was found in this folder.
vi: Không tìm thấy file VPL trong thư mục này.
zh_hans: 此文件夹中没有 VPL 文件。

# import.error.firmwareFolder
source: Could not read the firmware folder.
vi: Không đọc được thư mục firmware.
zh_hans: 无法读取固件文件夹。

# import.firmwareFiles
source: Select firmware files
vi: Chọn các file firmware
zh_hans: 选择固件文件

# import.error.duplicateFirmwareFile
source: Selected files have duplicate names. Choose one firmware set.
vi: Các file đã chọn bị trùng tên. Hãy chọn một bộ firmware.
zh_hans: 所选文件有重名。请选择一套固件。

# import.stopInstall
source: Stop installing
vi: Dừng cài đặt
zh_hans: 停止安装

# import.title
source: Install Device
vi: Cài thiết bị
zh_hans: 安装设备

# key.call
source: Call (green)
vi: Gọi (xanh lá)
zh_hans: 拨号键（绿色）

# key.clear
source: Clear (C)
vi: Xóa (C)
zh_hans: 清除键（C）

# key.down
source: Down
vi: Xuống
zh_hans: 下

# key.end
source: End (red)
vi: Kết thúc (đỏ)
zh_hans: 挂断键（红色）

# key.left
source: Left
vi: Trái
zh_hans: 左

# key.leftSoft
source: Left soft key
vi: Phím mềm trái
zh_hans: 左软键

# key.none
source: Not bound
vi: Chưa gán
zh_hans: 未绑定

# key.right
source: Right
vi: Phải
zh_hans: 右

# key.rightSoft
source: Right soft key
vi: Phím mềm phải
zh_hans: 右软键

# key.select
source: OK (Select)
vi: OK (Chọn)
zh_hans: 确认键（选择）

# key.up
source: Up
vi: Lên
zh_hans: 上

# keypad.accessibility.call
source: Call
vi: Gọi
zh_hans: 拨号

# keypad.accessibility.clear
source: Clear
vi: Xóa
zh_hans: 清除

# keypad.accessibility.end
source: End
vi: Kết thúc
zh_hans: 挂断

# keypad.editor.dragHint
source: Drag to reposition this control
vi: Kéo để đổi vị trí điều khiển này
zh_hans: 拖动以调整此控件的位置

# keypad.editor.editLayout
source: Edit Keypad Layout
vi: Chỉnh bố cục bàn phím
zh_hans: 编辑键盘布局

# keypad.editor.hint
source: Drag controls to adjust the layout
vi: Kéo các nút điều khiển để điều chỉnh bố cục
zh_hans: 拖动控件以调整布局

# keypad.editor.numberPad
source: Number pad
vi: Bàn phím số
zh_hans: 数字键盘

# keypad.editor.reset
source: Reset layout
vi: Đặt lại bố cục
zh_hans: 重置布局

# keypad.editor.visibleControls
source: Controls
vi: Nút điều khiển
zh_hans: 按键

# onboarding.device.body
source: Start by importing a ROM dump from a device you own. Some newer S60 devices also need the matching RPKG file.
vi: Bắt đầu bằng cách nhập bản dump ROM từ thiết bị bạn sở hữu. Một số thiết bị S60 đời mới còn cần tệp RPKG tương ứng.
zh_hans: 先从你拥有的设备导入 ROM 转储开始。部分较新的 S60 设备还需要配套的 RPKG 文件。

# onboarding.device.title
source: Install a Device
vi: Cài thiết bị
zh_hans: 安装设备

# onboarding.done
source: Get Started
vi: Bắt đầu
zh_hans: 开始使用

# onboarding.install.body
source: After a device is installed, use the + button to add SIS, SISX, or supported N-Gage content to the current device.
vi: Sau khi cài thiết bị, dùng nút + để thêm SIS, SISX hoặc nội dung N-Gage được hỗ trợ vào thiết bị hiện tại.
zh_hans: 安装设备后，用 + 按钮把 SIS、SISX 或受支持的 N-Gage 内容添加到当前设备。

# onboarding.install.title
source: Add Your Apps
vi: Thêm ứng dụng
zh_hans: 添加你的应用

# onboarding.legal.body
source: EKA2L1 does not include firmware, ROMs, or games. Use only content you own and dumped yourself.
vi: EKA2L1 không đi kèm firmware, ROM hoặc game. Chỉ sử dụng nội dung bạn sở hữu và tự dump.
zh_hans: EKA2L1 不含固件、ROM 或游戏。请只使用你自己拥有并亲自转储的内容。

# onboarding.legal.title
source: Bring Your Own Content
vi: Sử dụng nội dung của bạn
zh_hans: 自备内容

# onboarding.next
source: Next
vi: Tiếp
zh_hans: 下一步

# onboarding.title
source: Getting Started
vi: Bắt đầu sử dụng
zh_hans: 快速上手

# peripheral.keyboard
source: Keyboard
vi: Bàn phím
zh_hans: 键盘
